light-rail-tracker.org
#+TITLE: Baltimore Light Rail tracker
#+AUTHOR: Aaron Miller <me@aaron-miller.me>
#+LANGUAGE: en
#+OPTIONS: \n:t

* Introduction

** What is this?
It's a single-page web application which integrates a variety of APIs to produce a map showing:
- The Baltimore light rail lines and stations
- If you allow geolocation access, the closest station to your current location
- Real-time positions of trains currently in service
- ETA information for trains arriving at the station nearest you

** OK, but what /is/ this?
It's an Emacs Org-mode file that embodies the aforementioned single-page web application, written in the literate programming style. Exporting this file to HTML, using Org-mode's core export functionality, produces a build of the web application which you can host on your favorite server and use in your favorite browser.

The best way to read this document is in Emacs with Org 8.x and the Org and Emacs Lisp reference manuals installed. That way, you get the full benefit of this powerful programming environment, in which, for example, the full source and documentation of any Emacs Lisp function is just a few keystrokes away. (If you're wondering: =C-h f RET= while point is on the function name, then =TAB RET= in the ~*Help*~ buffer.)

Failing that, you'll probably get the most benefit out of this document if you come to it with a basic understanding of both Org mode and Emacs Lisp; the former, of course, since the document is written in it, and the latter so that you can understand what's going on in the Emacs Lisp utility functions used throughout this document.

That said, if you're totally unfamiliar with everything I've just mentioned, there's probably still something for you here. If nothing else, maybe an example of literate programming might come in handy. In any case, enjoy! And if you have questions, don't hesitate to [[mailto:me@aaron-miller.me][ask]].

* External libraries
Our app depends on a few externally hosted Javascript libraries, so let's go ahead and include them in the HTML document.

#+NAME: external-library-refs
#+BEGIN_SRC html :eval never
  <script type="text/javascript"
          src="http://danml.com/js/download.js"></script>
#+END_SRC

#+CALL: insert-wrapped-source(tag="div",block-name="external-library-refs") :results html

* Utility functions

