light-rail-tracker.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Baltimore Light Rail tracker</title>
<!-- 2016-02-14 Sun 16:15 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Aaron Miller &lt;me@aaron-miller.me&gt;" />
</head>
<body>
<div id="content">
<h1 class="title">Baltimore Light Rail tracker</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a>
<ul>
<li><a href="#sec-1-1">1.1. What is this?</a></li>
<li><a href="#sec-1-2">1.2. OK, but what <i>is</i> this?</a></li>
</ul>
</li>
<li><a href="#sec-2">2. External libraries</a></li>
<li><a href="#sec-3">3. Utility functions</a>
<ul>
<li><a href="#sec-3-1">3.1. expose-to-js</a></li>
<li><a href="#sec-3-2">3.2. insert-wrapped-source</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Org source download</a></li>
<li><a href="#sec-5">5. UI conveniences</a>
<ul>
<li><a href="#sec-5-1">5.1. Org pre styles</a></li>
<li><a href="#sec-5-2">5.2. Headline fold/unfold</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Application structure overview</a></li>
<li><a href="#sec-7">7. Data sources</a>
<ul>
<li><a href="#sec-7-1">7.1. Station data fixture</a></li>
<li><a href="#sec-7-2">7.2. Track data fixture</a></li>
<li><a href="#sec-7-3">7.3. Train position/status API</a></li>
<li><a href="#sec-7-4">7.4. Station's next four trains API</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Data transformations</a>
<ul>
<li><a href="#sec-8-1">8.1. Station data polyline initializers</a></li>
<li><a href="#sec-8-2">8.2. Track data polyline initializers</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Google map initialization</a>
<ul>
<li><a href="#sec-9-1">9.1. Instantiate the map</a></li>
<li><a href="#sec-9-2">9.2. Add track polylines</a></li>
<li><a href="#sec-9-3">9.3. Add station polylines</a></li>
</ul>
</li>
<li><a href="#sec-10">10. Train status updates</a>
<ul>
<li><a href="#sec-10-1">10.1. Define train info update function</a></li>
<li><a href="#sec-10-2">10.2. Invoke it on an interval</a></li>
</ul>
</li>
<li><a href="#sec-11">11. User position handling</a>
<ul>
<li><a href="#sec-11-1">11.1. Define user position update function</a></li>
<li><a href="#sec-11-2">11.2. Invoke it on an interval</a></li>
</ul>
</li>
<li><a href="#sec-12">12. UI miscellany</a>
<ul>
<li><a href="#sec-12-1">12.1. Views</a></li>
<li><a href="#sec-12-2">12.2. View toggle</a></li>
</ul>
</li>
<li><a href="#sec-13">13. App activation</a></li>
<li><a href="#sec-14">14. Org source&#xa0;&#xa0;&#xa0;<span class="tag"><span class="folded">folded</span></span></a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> What is this?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
It's a single-page web application which integrates a variety of APIs to produce a map showing:<br  />
</p>
<ul class="org-ul">
<li>The Baltimore light rail lines and stations<br  />
</li>
<li>If you allow geolocation access, the closest station to your current location<br  />
</li>
<li>Real-time positions of trains currently in service<br  />
</li>
<li>ETA information for trains arriving at the station nearest you<br  />
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> OK, but what <i>is</i> this?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
It's an Emacs Org-mode file that embodies the aforementioned single-page web application, written in the literate programming style. Exporting this file to HTML, using Org-mode's core export functionality, produces a build of the web application which you can host on your favorite server and use in your favorite browser.<br  />
</p>

<p>
The best way to read this document is in Emacs with Org 8.x and the Org and Emacs Lisp reference manuals installed. That way, you get the full benefit of this powerful programming environment, in which, for example, the full source and documentation of any Emacs Lisp function is just a few keystrokes away. (If you're wondering: <code>C-h f RET</code> while point is on the function name, then <code>TAB RET</code> in the <code>*Help*</code> buffer.)<br  />
</p>

<p>
Failing that, you'll probably get the most benefit out of this document if you come to it with a basic understanding of both Org mode and Emacs Lisp; the former, of course, since the document is written in it, and the latter so that you can understand what's going on in the Emacs Lisp utility functions used throughout this document.<br  />
</p>

<p>
That said, if you're totally unfamiliar with everything I've just mentioned, there's probably still something for you here. If nothing else, maybe an example of literate programming might come in handy. In any case, enjoy! And if you have questions, don't hesitate to <a href="mailto:me@aaron-miller.me">ask</a>.<br  />
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> External libraries</h2>
<div class="outline-text-2" id="text-2">
<p>
Our app depends on a few externally hosted Javascript libraries, so let's go ahead and include them in the HTML document.<br  />
</p>

<div class="org-src-container">

<pre class="src src-html" id="external-library-refs">&lt;<span style="color: #00bfff;">script</span> <span style="color: #eedd82;">type</span>=<span style="color: #dda0dd;">"text/javascript"</span>
        <span style="color: #eedd82;">src</span>=<span style="color: #dda0dd;">"http://danml.com/js/download.js"</span>&gt;&lt;/<span style="color: #00bfff;">script</span>&gt;
</pre>
</div>

<div >
<script type="text/javascript"
          src="http://danml.com/js/download.js"></script>
</div>
</div>
</div>
