light-rail-tracker.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Utility functions</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> expose-to-js</h3>
<div class="outline-text-3" id="text-3-1">
<p>
We'll find ourselves, later on, wanting an easy way to expose named Org blocks to the Javascript environment in the browser, so that they're available for our application code to use. Let's go ahead and define an Emacs Lisp utility function to do that.<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="expose-to-js">(and (not (string= block-name <span style="color: #dda0dd;">""</span>))
     (not (string= binding <span style="color: #dda0dd;">""</span>))
     (<span style="color: #4f94cd; font-style: italic;">save-excursion</span>
       (<span style="color: #4f94cd; font-style: italic;">let</span> ((json-encoding-pretty-print t)
             (block-lang <span style="color: #dda0dd;">""</span>)
             block-loc block-type from to
             block-contents cg-handle html-result)
         <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">Expand #+INCLUDE: keywords so that they become named</span>
         <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">blocks we can find. Since this expansion mutates the</span>
         <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">buffer contents, we do it within a change group so that it</span>
         <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">can be atomically reverted once we're done.</span>
         (setq cg-handle (prepare-change-group))
         (activate-change-group cg-handle)
         (org-export-expand-include-keyword)
         (<span style="color: #4f94cd; font-style: italic;">unwind-protect</span>
              (setq block-loc (org-babel-find-named-block block-name))
           (<span style="color: #4f94cd; font-style: italic;">if</span> (null block-loc)
               (<span style="color: #ffc0cb; font-weight: bold;">signal</span> 'no-such-block
                       (list (concat <span style="color: #dda0dd;">"Block '"</span> block-name
                                     <span style="color: #dda0dd;">"' not found in this buffer."</span>)))
               (<span style="color: #4f94cd; font-style: italic;">progn</span>
                 <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">Go to start of block (beginning of #+NAME: line)</span>
                 (goto-char block-loc)
                 <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">Find out what kind of block we're dealing with here,</span>
                 <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">so we can correctly find its end keyword</span>
                 (<span style="color: #4f94cd; font-style: italic;">save-match-data</span>
                   (re-search-forward <span style="color: #dda0dd;">"^#\\+BEGIN_</span><span style="color: #dda0dd; font-weight: bold;">\\</span><span style="color: #dda0dd; font-weight: bold;">(</span><span style="color: #dda0dd;">[A-Za-z]+</span><span style="color: #dda0dd; font-weight: bold;">\\</span><span style="color: #dda0dd; font-weight: bold;">)</span><span style="color: #dda0dd;">"</span>)
                   (setq block-type
                         (downcase (buffer-substring-no-properties
                                    (match-beginning 1) (match-end 1)))))
                 <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">Also capture the block language, if any, so that</span>
                 <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">we know what (if any) kind of unescaping we need</span>
                 <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">to do</span>
                 (<span style="color: #4f94cd; font-style: italic;">save-match-data</span>
                   (and (re-search-forward <span style="color: #dda0dd;">" *</span><span style="color: #dda0dd; font-weight: bold;">\\</span><span style="color: #dda0dd; font-weight: bold;">(</span><span style="color: #dda0dd;">[_[:alnum:]]+</span><span style="color: #dda0dd; font-weight: bold;">\\</span><span style="color: #dda0dd; font-weight: bold;">)</span><span style="color: #dda0dd;">"</span> nil t)
                        (setq block-lang
                              (buffer-substring-no-properties
                               (match-beginning 1) (match-end 1)))))
                 <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">Move ahead to the beginning of the first line in the</span>
                 <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">actual source, and store that as the character</span>
                 <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">position where we'll start capturing</span>
                 (end-of-line)
                 (forward-char 1)
                 (setq from (point))
                 <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">Move ahead to the end of the code block, and store</span>
                 <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">that as the character position where we'll stop</span>
                 <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">capturing</span>
                 (<span style="color: #4f94cd; font-style: italic;">save-match-data</span>
                   (re-search-forward (concat <span style="color: #dda0dd;">"^#\\+END_"</span> block-type <span style="color: #dda0dd;">"$"</span>)))
                 (beginning-of-line)
                 (setq to (point))
                 <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">Unescape Org keywords within the source block, if</span>
                 <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">this is an Org source block</span>
                 (and (string= <span style="color: #dda0dd;">"org"</span> block-lang)
                      (<span style="color: #4f94cd; font-style: italic;">progn</span>
                        (goto-char from)
                        (<span style="color: #4f94cd; font-style: italic;">save-match-data</span>
                          (<span style="color: #4f94cd; font-style: italic;">while</span> (and (not (&gt; (point) to))
                                      (re-search-forward <span style="color: #dda0dd;">"^</span><span style="color: #dda0dd; font-weight: bold;">\\</span><span style="color: #dda0dd; font-weight: bold;">(</span><span style="color: #dda0dd;"> *</span><span style="color: #dda0dd; font-weight: bold;">\\</span><span style="color: #dda0dd; font-weight: bold;">)</span><span style="color: #dda0dd;">,</span><span style="color: #dda0dd; font-weight: bold;">\\</span><span style="color: #dda0dd; font-weight: bold;">(</span><span style="color: #dda0dd;">#\\+</span><span style="color: #dda0dd; font-weight: bold;">\\</span><span style="color: #dda0dd; font-weight: bold;">|</span><span style="color: #dda0dd;">\\*</span><span style="color: #dda0dd; font-weight: bold;">\\</span><span style="color: #dda0dd; font-weight: bold;">)</span><span style="color: #dda0dd;">"</span>
                                                         to t))
                            (replace-match <span style="color: #dda0dd;">"\\1\\2"</span>)
                            (setq to (- to 1))))))
                 <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">Capture the source block contents...</span>
                 (setq block-contents
                       (buffer-substring-no-properties from to))
                 <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">...and put together a string with the &lt;script&gt; tag</span>
                 (setq html-result
                       (concat <span style="color: #dda0dd;">"&lt;script type=\"text/javascript\"&gt;"</span> <span style="color: #dda0dd;">"\n"</span>
                               <span style="color: #dda0dd;">"window."</span> binding
                               <span style="color: #dda0dd;">" = "</span>
                               (json-encode block-contents) <span style="color: #dda0dd;">";"</span>
                               <span style="color: #dda0dd;">"\n"</span>
                               <span style="color: #dda0dd;">"&lt;/script&gt;"</span>))
                 (cancel-change-group cg-handle)))
           <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">Make sure we don't leave the buffer mutated if we signal</span>
           <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">(this is the `</span><span style="color: #7fffd4; font-style: italic;">unwind-protect</span><span style="color: #00cd00; font-style: italic;">''s unwind form)</span>
           (cancel-change-group cg-handle))
         <span style="color: #00cd00; font-style: italic;">;; </span><span style="color: #00cd00; font-style: italic;">Finally, return the HTML string</span>
         html-result)))
</pre>
</div>
</div>
</div>
