light-rail-tracker.org
** insert-wrapped-source
Org-mode doesn't currently support syntax highlighting in example blocks, and also doesn't support named references to the literal content of a source block (rather than the results of evaluating that source block).

This is a pain in the neck for us, because we want to do both of these things. Defining our app's Javascript and CSS code in source code blocks is the only way to get it syntax-highlighted in the exported HTML, and of course we need to be able to insert the raw contents of these source blocks into the exported HTML, so that the browser will make use of them.

Fortunately, Org is smarter than it knows, and provides a couple of lower-level functions, =org-babel-find-named-block= and =org-babel-read-result=, which make it almost trivial to fetch the contents of a source block. We just need to write a little glue code that'll leverage them to fetch the source we need, and a little more that'll wrap that source in a suitable HTML tag. Here's how we do that:

#+NAME: insert-wrapped-source
#+BEGIN_SRC emacs-lisp :exports code :results silent :var tag="" :var attrs=() :var block-name=""
  (and (not (string= tag ""))
       (not (string= block-name ""))
       (cl-flet ((stringify (alist)
                            (mapconcat #'identity
                                       (mapcar #'(lambda (pair)
                                                   (concat (symbol-name (car pair))
                                                           "=" "\"" (cdr pair) "\""))
                                               alist) " ")))
         (let ((block-loc (org-babel-find-named-block block-name))
               source)
           (if (null block-loc)
               (signal 'no-such-block 
                       (list (concat "Block '" block-name "' not found in this buffer.")))
               (save-excursion
                 (goto-char block-loc)
                 (setq source (org-babel-read-result))
                 (concat "<" tag " " (stringify attrs) ">" "\n"
                         source "\n"
                         "</" tag ">"))))))
#+END_SRC

Now that it's defined, we can insert calls to it in our Org file like so:

#+BEGIN_EXAMPLE
#+CALL: insert-wrapped-source(tag="script",attrs='((type . "text/javascript")),block-name="a-javascript-source-block") :results html
#+END_EXAMPLE

and have Org emit the contents of the named block =a-javascript-source-block=, wrapped in ~<script type="text/javascript">~ and ~</script>~.

