light-rail-tracker.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> insert-wrapped-source</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Org-mode doesn't currently support syntax highlighting in example blocks, and also doesn't support named references to the literal content of a source block (rather than the results of evaluating that source block).<br  />
</p>

<p>
This is a pain in the neck for us, because we want to do both of these things. Defining our app's Javascript and CSS code in source code blocks is the only way to get it syntax-highlighted in the exported HTML, and of course we need to be able to insert the raw contents of these source blocks into the exported HTML, so that the browser will make use of them.<br  />
</p>

<p>
Fortunately, Org is smarter than it knows, and provides a couple of lower-level functions, <code>org-babel-find-named-block</code> and <code>org-babel-read-result</code>, which make it almost trivial to fetch the contents of a source block. We just need to write a little glue code that'll leverage them to fetch the source we need, and a little more that'll wrap that source in a suitable HTML tag. Here's how we do that:<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="insert-wrapped-source">(and (not (string= tag <span style="color: #dda0dd;">""</span>))
     (not (string= block-name <span style="color: #dda0dd;">""</span>))
     (<span style="color: #4f94cd; font-style: italic;">cl-flet</span> ((stringify (alist)
                          (mapconcat #'identity
                                     (mapcar #'(<span style="color: #4f94cd; font-style: italic;">lambda</span> (pair)
                                                 (concat (symbol-name (car pair))
                                                         <span style="color: #dda0dd;">"="</span> <span style="color: #dda0dd;">"\""</span> (cdr pair) <span style="color: #dda0dd;">"\""</span>))
                                             alist) <span style="color: #dda0dd;">" "</span>)))
       (<span style="color: #4f94cd; font-style: italic;">let</span> ((block-loc (org-babel-find-named-block block-name))
             source)
         (<span style="color: #4f94cd; font-style: italic;">if</span> (null block-loc)
             (<span style="color: #ffc0cb; font-weight: bold;">signal</span> 'no-such-block 
                     (list (concat <span style="color: #dda0dd;">"Block '"</span> block-name <span style="color: #dda0dd;">"' not found in this buffer."</span>)))
             (<span style="color: #4f94cd; font-style: italic;">save-excursion</span>
               (goto-char block-loc)
               (setq source (org-babel-read-result))
               (concat <span style="color: #dda0dd;">"&lt;"</span> tag <span style="color: #dda0dd;">" "</span> (stringify attrs) <span style="color: #dda0dd;">"&gt;"</span> <span style="color: #dda0dd;">"\n"</span>
                       source <span style="color: #dda0dd;">"\n"</span>
                       <span style="color: #dda0dd;">"&lt;/"</span> tag <span style="color: #dda0dd;">"&gt;"</span>))))))
</pre>
</div>

<p>
Now that it's defined, we can insert calls to it in our Org file like so:<br  />
</p>

<pre class="example">
#+CALL: insert-wrapped-source(tag="script",attrs='((type . "text/javascript")),block-name="a-javascript-source-block") :results html
</pre>

<p>
and have Org emit the contents of the named block <code>a-javascript-source-block</code>, wrapped in <code>&lt;script type="text/javascript"&gt;</code> and <code>&lt;/script&gt;</code>.<br  />
</p>
</div>
</div>
</div>
