light-rail-tracker.org
* UI conveniences
** Org pre styles
The default Org-mode template is a little bit incomplete when it comes to the ~<pre>~ tags enclosing source and example blocks. Let's fix that up a little.

While we're at it, let's apply line wrapping to the document source where we include it in itself, so that its many long lines don't require a lot of horizontal scrolling. We'll also get rid of the rather ill-thought-out corner tag that would ordinarily appear when mousing over source blocks with known languages.

#+NAME: pre-styles
#+BEGIN_SRC css :eval never
  pre.src, pre.example {
    background: #002;
    color: #f0f8ff;
    overflow-x: auto;
    padding: 5px;
    border: black solid 3px;
    border-radius: 5px;
  }

  pre#light-rail-tracker\.org {
    white-space: pre-wrap;
  }

  pre::before {
    display: none !important;
  }
#+END_SRC
#+CALL: insert-wrapped-source(tag="style",attrs='((type . "text/css")),block-name="pre-styles") :results html

