light-rail-tracker.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> UI conveniences</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Org pre styles</h3>
<div class="outline-text-3" id="text-5-1">
<p>
The default Org-mode template is a little bit incomplete when it comes to the <code>&lt;pre&gt;</code> tags enclosing source and example blocks. Let's fix that up a little.<br  />
</p>

<p>
While we're at it, let's apply line wrapping to the document source where we include it in itself, so that its many long lines don't require a lot of horizontal scrolling. We'll also get rid of the rather ill-thought-out corner tag that would ordinarily appear when mousing over source blocks with known languages.<br  />
</p>

<div class="org-src-container">

<pre class="src src-css" id="pre-styles"><span style="color: #00bfff;">pre.src, pre.example </span>{
  <span style="color: #eedd82;">background</span>: #002;
  <span style="color: #eedd82;">color</span>: #f0f8ff;
  <span style="color: #eedd82;">overflow-x</span>: auto;
  <span style="color: #eedd82;">padding</span>: 5px;
  <span style="color: #eedd82;">border</span>: black solid 3px;
  <span style="color: #eedd82;">border-radius</span>: 5px;
}

<span style="color: #00bfff;">pre#light-rail-tracker\.org </span>{
  <span style="color: #eedd82;">white-space</span>: pre-wrap;
}

<span style="color: #eedd82;">pre</span>::before {
  <span style="color: #eedd82;">display</span>: none <span style="color: #b0c4de;">!important</span>;
}
</pre>
</div>
<style type="text/css">
pre.src, pre.example {
    background: #002;
    color: #f0f8ff;
    overflow-x: auto;
    padding: 5px;
    border: black solid 3px;
    border-radius: 5px;
  }

  pre#light-rail-tracker\.org {
    white-space: pre-wrap;
  }

  pre::before {
    display: none !important;
  }
</style>
</div>
</div>
