light-rail-tracker.org
* Application structure overview

* Data sources
** Station data fixture
** Track data fixture
** Train position/status API
** Station's next four trains API

* Data transformations
** Station data polyline initializers
** Track data polyline initializers

* Google map initialization
** Instantiate the map
** Add track polylines
** Add station polylines

* Train status updates
** Define train info update function
- Get train API
- Render trains as map markers
** Invoke it on an interval

* User position handling
** Define user position update function
- Get user position
- Render it as a map marker
- Find closest station
- Center the map at midpoint between user & closest station
- Zoom the map to show user & closest station
** Invoke it on an interval

* UI miscellany
** Views
- App view: map takes up whole viewport
- Org view: map fits into document flow so that app document is visible
#+NAME: map-views
#+BEGIN_SRC css :eval never
  .map-container.app-view {
    z-index: 1000;
    position: fixed;
    left: 0px;
    right: 0px;
    top: 0px;
    bottom: 0px;
  }

  .map-container.org-view {
    position: static;
    width: 100%;
    height: 600px;
  }
#+END_SRC
#+CALL: insert-wrapped-source(tag="style",attrs='((type . "text/css")),block-name="map-views") :results html
** View toggle
- A fixed-position overlay button to switch between app & org view

* App activation
- Switch to app view

* Org source                                        :folded:
This is the complete source of the Org-mode document from which this file was generated.

#+NAME: light-rail-tracker.org
#+INCLUDE: "./light-rail-tracker.org" src org

* COMMENT File-local variables
There are a lot of source blocks in this file. Having to answer a prompt before each one is evaluated gets old fast. Thus we set ~org-confirm-babel-evaluate~ to ~nil~, so that those prompts won't occur.

When loading this file in Emacs, it will prompt before setting the value, because *this is an extremely risky file-local variable* -- specifically, if you do this in a file of untrusted code, all of said code will execute during export or when you invoke ~org-babel-execute-buffer~. Therefore, if you have any doubts about whether the code in a file is trustworthy, don't let it set this value.

Of course, my code in this file isn't out to hose you -- but, for your sake, I really hope you won't take my word for that.

# Local Variables:
# org-confirm-babel-evaluate: nil
# End:
