light-rail-tracker.html

<span style="color: #c1ffc1; font-size: 125%; font-weight: bold;">* Application structure overview</span>

<span style="color: #c1ffc1; font-size: 125%; font-weight: bold;">* Data sources</span>
<span style="color: #c1ffc1; font-size: 103%; font-weight: bold;">** Station data fixture</span>
<span style="color: #c1ffc1; font-size: 103%; font-weight: bold;">** Track data fixture</span>
<span style="color: #c1ffc1; font-size: 103%; font-weight: bold;">** Train position/status API</span>
<span style="color: #c1ffc1; font-size: 103%; font-weight: bold;">** Station's next four trains API</span>

<span style="color: #c1ffc1; font-size: 125%; font-weight: bold;">* Data transformations</span>
<span style="color: #c1ffc1; font-size: 103%; font-weight: bold;">** Station data polyline initializers</span>
<span style="color: #c1ffc1; font-size: 103%; font-weight: bold;">** Track data polyline initializers</span>

<span style="color: #c1ffc1; font-size: 125%; font-weight: bold;">* Google map initialization</span>
<span style="color: #c1ffc1; font-size: 103%; font-weight: bold;">** Instantiate the map</span>
<span style="color: #c1ffc1; font-size: 103%; font-weight: bold;">** Add track polylines</span>
<span style="color: #c1ffc1; font-size: 103%; font-weight: bold;">** Add station polylines</span>

<span style="color: #c1ffc1; font-size: 125%; font-weight: bold;">* Train status updates</span>
<span style="color: #c1ffc1; font-size: 103%; font-weight: bold;">** Define train info update function</span>
- Get train API
- Render trains as map markers
<span style="color: #c1ffc1; font-size: 103%; font-weight: bold;">** Invoke it on an interval</span>

<span style="color: #c1ffc1; font-size: 125%; font-weight: bold;">* User position handling</span>
<span style="color: #c1ffc1; font-size: 103%; font-weight: bold;">** Define user position update function</span>
- Get user position
- Render it as a map marker
- Find closest station
- Center the map at midpoint between user &amp; closest station
- Zoom the map to show user &amp; closest station
<span style="color: #c1ffc1; font-size: 103%; font-weight: bold;">** Invoke it on an interval</span>

<span style="color: #c1ffc1; font-size: 125%; font-weight: bold;">* UI miscellany</span>
<span style="color: #c1ffc1; font-size: 103%; font-weight: bold;">** Views</span>
- App view: map takes up whole viewport
- Org view: map fits into document flow so that app document is visible
<span style="color: #00cd00; font-style: italic;">#+NAME: map-views</span>
<span style="color: #00cd00; font-style: italic;">#+BEGIN_SRC css :eval never</span>
<span style="color: #00bfff;">  .map-container.app-view </span>{
    <span style="color: #eedd82;">z-index</span>: 1000;
    <span style="color: #eedd82;">position</span>: fixed;
    <span style="color: #eedd82;">left</span>: 0px;
    <span style="color: #eedd82;">right</span>: 0px;
    <span style="color: #eedd82;">top</span>: 0px;
    <span style="color: #eedd82;">bottom</span>: 0px;
  }

<span style="color: #00bfff;">  .map-container.org-view </span>{
    <span style="color: #eedd82;">position</span>: static;
    <span style="color: #eedd82;">width</span>: 100%;
    <span style="color: #eedd82;">height</span>: 600px;
  }
<span style="color: #00cd00; font-style: italic;">#+END_SRC</span>
<span style="color: #00cd00; font-style: italic;">#+CALL: insert-wrapped-source(tag="style",attrs='((type . "text/css")),block-name="map-views") :results html</span>
<span style="color: #c1ffc1; font-size: 103%; font-weight: bold;">** View toggle</span>
- A fixed-position overlay button to switch between app &amp; org view

<span style="color: #c1ffc1; font-size: 125%; font-weight: bold;">* App activation</span>
- Switch to app view

<span style="color: #c1ffc1; font-size: 125%; font-weight: bold;">* Org source                                        </span><span style="color: #7fffd4; font-size: 125%; font-weight: bold;">:folded:</span>
This is the complete source of the Org-mode document from which this file was generated.

<span style="color: #00cd00; font-style: italic;">#+NAME: light-rail-tracker.org</span>
<span style="color: #00cd00; font-style: italic;">#+INCLUDE: "./light-rail-tracker.org" src org</span>

<span style="color: #c1ffc1; font-size: 125%; font-weight: bold;">* </span><span style="color: #4f94cd; font-style: italic;">COMMENT</span><span style="color: #c1ffc1; font-size: 125%; font-weight: bold;"> File-local variables</span>
There are a lot of source blocks in this file. Having to answer a prompt before each one is evaluated gets old fast. Thus we set ~org-confirm-babel-evaluate~ to ~nil~, so that those prompts won't occur.

When loading this file in Emacs, it will prompt before setting the value, because *this is an extremely risky file-local variable* -- specifically, if you do this in a file of untrusted code, all of said code will execute during export or when you invoke ~org-babel-execute-buffer~. Therefore, if you have any doubts about whether the code in a file is trustworthy, don't let it set this value.

Of course, my code in this file isn't out to hose you -- but, for your sake, I really hope you won't take my word for that.

<span style="color: #00cd00; font-style: italic;"># Local Variables&#58;</span>
<span style="color: #00cd00; font-style: italic;"># org-confirm-babel-evaluate: nil</span>
<span style="color: #00cd00; font-style: italic;"># End:</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Aaron Miller &lt;me@aaron-miller.me&gt;</p>
<p class="date">Created: 2016-02-14 Sun 16:15</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
